<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol.lst-kix_odigsdc3au7g-3{list-style-type:none}ol.lst-kix_odigsdc3au7g-3.start{counter-reset:lst-ctn-kix_odigsdc3au7g-3 0}ol.lst-kix_odigsdc3au7g-4{list-style-type:none}ol.lst-kix_odigsdc3au7g-5{list-style-type:none}ol.lst-kix_odigsdc3au7g-6{list-style-type:none}ol.lst-kix_odigsdc3au7g-0{list-style-type:none}ol.lst-kix_odigsdc3au7g-8.start{counter-reset:lst-ctn-kix_odigsdc3au7g-8 0}ol.lst-kix_odigsdc3au7g-1{list-style-type:none}ol.lst-kix_odigsdc3au7g-2{list-style-type:none}.lst-kix_odigsdc3au7g-1>li{counter-increment:lst-ctn-kix_odigsdc3au7g-1}.lst-kix_odigsdc3au7g-6>li{counter-increment:lst-ctn-kix_odigsdc3au7g-6}.lst-kix_odigsdc3au7g-7>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-7,lower-latin) ". "}.lst-kix_odigsdc3au7g-3>li{counter-increment:lst-ctn-kix_odigsdc3au7g-3}.lst-kix_odigsdc3au7g-6>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-6,decimal) ". "}ol.lst-kix_odigsdc3au7g-7{list-style-type:none}ol.lst-kix_odigsdc3au7g-8{list-style-type:none}.lst-kix_odigsdc3au7g-0>li{counter-increment:lst-ctn-kix_odigsdc3au7g-0}ol.lst-kix_odigsdc3au7g-0.start{counter-reset:lst-ctn-kix_odigsdc3au7g-0 0}.lst-kix_odigsdc3au7g-8>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-8,lower-roman) ". "}.lst-kix_odigsdc3au7g-4>li{counter-increment:lst-ctn-kix_odigsdc3au7g-4}ol.lst-kix_odigsdc3au7g-5.start{counter-reset:lst-ctn-kix_odigsdc3au7g-5 0}.lst-kix_odigsdc3au7g-7>li{counter-increment:lst-ctn-kix_odigsdc3au7g-7}.lst-kix_odigsdc3au7g-5>li{counter-increment:lst-ctn-kix_odigsdc3au7g-5}.lst-kix_odigsdc3au7g-2>li{counter-increment:lst-ctn-kix_odigsdc3au7g-2}.lst-kix_odigsdc3au7g-8>li{counter-increment:lst-ctn-kix_odigsdc3au7g-8}ol.lst-kix_odigsdc3au7g-2.start{counter-reset:lst-ctn-kix_odigsdc3au7g-2 0}ol.lst-kix_odigsdc3au7g-4.start{counter-reset:lst-ctn-kix_odigsdc3au7g-4 0}ol.lst-kix_odigsdc3au7g-7.start{counter-reset:lst-ctn-kix_odigsdc3au7g-7 0}.lst-kix_odigsdc3au7g-4>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-4,lower-latin) ". "}.lst-kix_odigsdc3au7g-3>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-3,decimal) ". "}.lst-kix_odigsdc3au7g-5>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-5,lower-roman) ". "}ol.lst-kix_odigsdc3au7g-6.start{counter-reset:lst-ctn-kix_odigsdc3au7g-6 0}.lst-kix_odigsdc3au7g-0>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-0,decimal) ". "}.lst-kix_odigsdc3au7g-1>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-1,lower-latin) ". "}ol.lst-kix_odigsdc3au7g-1.start{counter-reset:lst-ctn-kix_odigsdc3au7g-1 0}.lst-kix_odigsdc3au7g-2>li:before{content:"" counter(lst-ctn-kix_odigsdc3au7g-2,lower-roman) ". "}ol{margin:0;padding:0}table td,table th{padding:0}.c1{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Times New Roman";font-style:normal}.c0{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c3{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c2{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c3"><p class="c0"><span class="c1">1. &#1044;&#1056;&#1040;&#1050;&#1054;&#1053; <br></span></p><p class="c0"><span class="c1">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1085;&#1091;&#1078;&#1076; &#1089;&#1086;&#1074;&#1077;&#1090;&#1089;&#1082;&#1086;&#1081; &#1082;&#1086;&#1089;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1077; &#1087;&#1077;&#1088;&#1077;&#1078;&#1080;&#1074;&#1096;&#1080;&#1081;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1089;&#1074;&#1086;&#1102; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1092;&#1080;&#1083;&#1086;&#1089;&#1086;&#1092;&#1080;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1086;&#1087;&#1080;&#1088;&#1072;&#1102;&#1097;&#1091;&#1102;&#1089;&#1103; &#1085;&#1072; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1077; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; (&#1088;&#1077;&#1092;&#1077;&#1088;&#1077;&#1085;&#1089; &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1097;&#1080;&#1085;&#1099;). &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1086;&#1074;. &#1045;&#1089;&#1090;&#1100; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080;) : &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;-&#1089;, &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;-java, &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;-&#1057;#, &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;-PASCAL.</span></p><p class="c0"><span class="c1">&#1050;&#1072;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086;: &#1073;&#1083;&#1086;&#1082;-&#1089;&#1093;&#1077;&#1084;&#1072; - &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1085;&#1072; &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;&#1077; - &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1076; &#1085;&#1072; Pascal&rsquo;&#1077;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1087;&#1077;&#1088;&#1077;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1073;&#1083;&#1086;&#1082;-&#1089;&#1093;&#1077;&#1084;&#1072;&#1084;&#1080; - &#1091; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1085;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1086;&#1085;&#1082;&#1086;&#1081; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; ( &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; Blueprint &#1086;&#1090; Unreal Engine). &#1050;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1089;&#1090;&#1100; &#1074; &#1082;&#1086;&#1076; &#1085;&#1072; Pascal&rsquo;e &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1072;. &#1042;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1082;&#1086;&#1083;&#1093;&#1086;&#1079;&#1085;&#1086;.</span></p><p class="c0"><span class="c1">&#1042; &#1094;&#1077;&#1083;&#1086;&#1084;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1080; &#1048;&#1057; &#1044;&#1056;&#1040;&#1050;&#1054;&#1053; &#1080; &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1041;&#1091;&#1088;&#1072;&#1085;.</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">2. Blueprint unreal\ Blueprint visual scripting</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">&#1041;&#1077;&#1079;&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1081; &#1092;&#1072;&#1074;&#1086;&#1088;&#1080;&#1090;. &#1041;&#1086;&#1075;&#1072;&#1090;&#1099;&#1081; &#1090;&#1091;&#1090;&#1086;&#1088;&#1080;&#1072;&#1083; (&#1087;&#1088;&#1072;&#1074;&#1076;&#1072;, &#1085;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084;), &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1086;&#1074;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1080;&#1085;&#1090;&#1091;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1081; UI, &#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1099;&#1081; &#1075;&#1083;&#1072;&#1079;&#1091;. &#1053;&#1054;: &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085; &#1076;&#1074;&#1080;&#1078;&#1082;&#1086;&#1084; - &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;, &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1076;&#1074;&#1080;&#1078;&#1082;&#1091;, &#1085;&#1072; &#1085;&#1077;&#1084; &#1085;&#1077; &#1087;&#1086;&#1087;&#1080;&#1096;&#1077;&#1096;&#1100;; &#1087;&#1083;&#1072;&#1090;&#1085;&#1072;&#1103; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1082;&#1072; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; Unreal Engine - &#1089;&#1090;&#1086;&#1080;&#1090; &#1076;&#1077;&#1085;&#1077;&#1075;. &#1050;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; C++, &#1085;&#1077; &#1074;&#1089;&#1077;&#1086;&#1073;&#1098;&#1077;&#1084;&#1083;&#1102;&#1097;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1076;&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1074;&#1089;&#1077; &#1085;&#1072; &#1090;&#1086;&#1084; &#1078;&#1077; C++.</span></p><p class="c0"><span class="c1">&#1048;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1079;&#1072;&#1080;&#1084;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1077; &#1074; &#1101;&#1090;&#1086;&#1084; &#1103;&#1079;&#1099;&#1082;&#1077;, &#1090;.&#1082;. &#1086;&#1085;&#1086; user-friendly, &#1073;&#1086;&#1083;&#1077;&#1077; &#1075;&#1080;&#1073;&#1082;&#1086;&#1077; &#1085;&#1077;&#1078;&#1077;&#1083;&#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; (&#1044;&#1056;&#1040;&#1050;&#1054;&#1053;, HiAsm). &#1059;&#1090;&#1086;&#1095;&#1085;&#1077;&#1085;&#1080;&#1077;: &#1085;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; Blueprint &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; C++ - &#1086;&#1085; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; C++, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1102;&#1073;&#1072;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072; Blueprint, &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; C++.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">3. HiAsm, &#1089;&#1088;&#1077;&#1076;&#1072; Hion</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">&#1058;&#1077;&#1084;&#1085;&#1072;&#1103; &#1083;&#1086;&#1096;&#1072;&#1076;&#1082;&#1072; &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;, &#1085;&#1086; &#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086; &#1074;&#1086; &#1095;&#1090;&#1086; &#1086;&#1085; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; (&#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;?) (&#1087;&#1086;&#1082;&#1072;, &#1073;&#1091;&#1076;&#1091; &#1077;&#1097;&#1077; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100;). &#1048;&#1079; &#1087;&#1083;&#1102;&#1089;&#1086;&#1074;: &#1080;&#1084;&#1077;&#1077;&#1090; web-&#1074;&#1077;&#1088;&#1089;&#1080;&#1102;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1084; &#1087;&#1088;&#1103;&#1084;&#1086; &#1074; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077; (&#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1077;&#1089;&#1090;&#1100; &#1074; #useful_info &#1087;&#1086; &#1087;&#1086;&#1080;&#1089;&#1082;&#1091; &#1055;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1085;&#1072;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;). &#1042;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1085;&#1077;&#1078;&#1077;&#1083;&#1080; &#1044;&#1056;&#1040;&#1050;&#1054;&#1053;, &#1093;&#1086;&#1090;&#1103; &#1085;&#1072;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1085;&#1072;&#1088;&#1077;&#1082;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; , &#1095;&#1090;&#1086;, &#1076;&#1091;&#1084;&#1072;&#1102;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1072; &#1085;&#1077;&#1084;, &#1087;&#1088;&#1086;&#1087;&#1072;&#1076;&#1077;&#1090;.</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">4. FBD</span></p><p class="c0"><span class="c1">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; PLC. &#1053;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1103; &#1087;&#1086;&#1085;&#1103;&#1083;, &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1080;&#1084; &#1079;&#1072;&#1076;&#1072;&#1095;&#1077;&#1081;. &#1044;&#1083;&#1103; &#1085;&#1072;&#1089; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1072;&#1083;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;.</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">5. VAX </span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">&#1057;&#1088;&#1077;&#1076;&#1072;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1072;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; SQL-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084; &#1089;&#1093;&#1077;&#1084;&#1099;, &#1090;.&#1077;. &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1055;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; JavaScript, &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; JavaS&#1089;ript &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; (&#1086;&#1073;&#1097;&#1080;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;).</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">6. Blockly</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; 2012 &#1075;&#1086;&#1076;&#1072;. &#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; JavaScript. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1080; , &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1100; - &#1103;&#1079;&#1099;&#1082; &#1076;&#1083;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1096;&#1082;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1086;&#1074;. &#1057;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1075;&#1076;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1082;&#1086;&#1076;&#1072;. &#1050;&#1072;&#1082; &#1084;&#1085;&#1077; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;, &#1093;&#1086;&#1090;&#1100; &#1103;&#1079;&#1099;&#1082; &#1080; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1095;&#1077;&#1088;&#1090;&#1086;&#1081; &#1074;&#1089;&#1077;&#1093; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; - &#1085;&#1072;&#1075;&#1083;&#1103;&#1076;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1091;&#1078; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;. &#1053;&#1072;&#1076;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1077;&#1088;&#1100;&#1077;&#1079;&#1085;&#1086;&#1077;.</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0"><span class="c1">&#1045;&#1089;&#1083;&#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1090;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1087;&#1083;&#1102;&#1089;&#1099; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; - &#1101;&#1090;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1090;&#1072; &#1086;&#1089;&#1074;&#1086;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1072;&#1085;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; - &#1082;&#1072;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;, &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091; &#1087;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; ( &#1087;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1077;&#1084;&#1089;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1072;&#1082;&#1094;&#1077;&#1085;&#1090; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072; &#1101;&#1090;&#1091; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;). &#1063;&#1072;&#1089;&#1090;&#1086; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1090;&#1089;&#1103; &#1057;&#1042;&#1056; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; &#1074; &#1085;&#1080;&#1093;. &#1054; UI, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072; &#1080; &#1087;&#1088;. &#1073;&#1091;&#1076;&#1077;&#1084; &#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1080;&#1077; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1099;. &nbsp;&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;&#1089;&#1103;.</span></p><p class="c0 c2"><span class="c1"></span></p><p class="c0 c2"><span class="c1"></span></p></body></html>